[{"content":"this year marks the centennial anniversary of the proclamation of the Kingdom of Saudi Arabia.  ","id":"1","topic":"Saudi Arabia","unitType":"premise"},{"content":"The leadership, vision and commitment of the Government of Saudi Arabia and its people have created a society where education, economic development and diversification have become priorities.  ","id":"1","topic":"Saudi Arabia","unitType":"premise"},{"content":"The development of infrastructure and the petrochemical industry have transformed a barren land into one of the most advanced nations of the world.  ","id":"1","topic":"Saudi Arabia","unitType":"premise"},{"content":"The Saudi Arabian people have built a moderate nation that is dedicated to promoting peace and stability.  ","id":"1","topic":"Saudi Arabia","unitType":"premise"},{"content":"On behalf of my colleagues and all Canadians, I ask His Excellency Dr. Mohammed Al-Hussaini, the Ambassador of Saudi Arabia, to extend our warmest congratulations to the Government of Saudi Arabia and its people, the people of this exceptional nation.  ","id":"1","topic":"Saudi Arabia","unitType":"conclusion"},{"content":"I would like to wish them a happy anniversary.  ","id":"1","topic":"Saudi Arabia","unitType":"premise"},{"content":"on November 10, UN Women elected its first executive board.  ","id":"2","topic":"Saudi Arabia","unitType":"premise"},{"content":"This new agency ?will work...to improve the status of women and girls?, said United Nations Deputy Secretary-General Asha-Rose Migiro.  ","id":"2","topic":"Saudi Arabia","unitType":"premise"},{"content":"This entity, charged with ensuring that the UN's commitments to establish gender equality within its institutions are kept, is a competent authority among member states for bringing about this equality.  ","id":"2","topic":"Saudi Arabia","unitType":"premise"},{"content":"It is troubling to see that Saudi Arabia has a seat on this executive board.  ","id":"2","topic":"Saudi Arabia","unitType":"premise"},{"content":"The customs and traditions of that country infringe on women's rights daily.  ","id":"2","topic":"Saudi Arabia","unitType":"premise"},{"content":"It is a country where Nathalie Morin, a Quebecker, is stuck and being held prisoner, along with her children.  ","id":"2","topic":"Saudi Arabia","unitType":"premise"},{"content":"If Saudi Arabia wants to demonstrate its desire for equality and justice between men and women, then its authorities have to take the first concrete step and let Nathalie Morin and her children return to Quebec.  ","id":"2","topic":"Saudi Arabia","unitType":"conclusion"},{"content":"if equality is the ultimate goal that a civil society aspires to, then racism is its implacable foe.  ","id":"3","topic":"Racism","unitType":"premise"},{"content":"Canadians have struggled and fought hard against the vile enemy of social cohesion and although we have been enormously successful in integrating almost 200 different nationalities, we are far from perfect.  ","id":"3","topic":"Racism","unitType":"premise"},{"content":"The ghettoization in large centres, the enormous difficulties aboriginal people face in integrating into Canadian society, the politically correct reverse discrimination that occurs still demonstrate that much needs to be done.  ","id":"3","topic":"Racism","unitType":"premise"},{"content":"We must continue to enforce laws that penalize the purveyors of racism, ensure that racism labels are never falsely used, strengthen the level playing field where opportunities exist and the responsibility to take advantage of those opportunities rests with the individual, and that people are judged on their merit and not on the colour of their skin.  ","id":"3","topic":"Racism","unitType":"conclusion"},{"content":"On this international day of elimination of racial discrimination I would like to thank Canada for the opportunity that Canada has given to me to be judged not on the colour of my skin but on my abilities.  ","id":"3","topic":"Racism","unitType":"premise"},{"content":"prostitution is not a career choice.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"Many women get involved in prostitution to feed their drug addiction.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"Fines and prison are not the solution to drug-related prostitution.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"Prevention is better than repression.   We have to address the problem at its source.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"In other words, we have to address substance abuse and addiction.  ","id":"4","topic":"Prostitution","unitType":"conclusion"},{"content":"That is what a number of groups and elected officials are trying to do in Hochelaga.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"The community organization Dopamine, which works in addictions services, wants to relocate to a neighbourhood where the need for its services is greatest.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"A respite care centre would be set up at Dopamine's former location where prostitutes could go to shower and sleep, and get help when they are ready to get out of the business.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"However, despite the recommendation of the Agence de sant? de Montr?al, the application to the Homelessness Partnering Strategy to relocate Dopamine has been dragging on for months.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"What is more, I have received no response to the letter I sent to the Minister of Human Resources explaining this increasingly critical situation.  ","id":"4","topic":"Prostitution","unitType":"premise"},{"content":"I hope to receive a positive response soon and I hope that the budget tabled a little later on will not abandon these people who feel increasingly forgotten by society.  ","id":"4","topic":"Prostitution","unitType":"conclusion"},{"content":"as Canadians we have a lot to be proud of, but we must take responsibility for the not so great.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"It is shameful that with all we know that the continued abuse and victimization of women and children exists in our society.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"The sex trade creates many victims.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"Some people from my town see this every day.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"People are fed up with seeing drug and prostitution paraphernalia littered through their neighbourhoods and have taken matters into their own hands by creating a group called Residents Against Street Solicitation.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"It is known as RASS, Residents against Street Prostitution and Solicitation.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"I call on the government to stand up for women and children, and provide more resources and social programs to women in need.  ","id":"5","topic":"Prostitution","unitType":"conclusion"},{"content":"Prostitution is a problem that illustrates the social inequalities between the sexes.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"The government wants to protect men with guns, but is doing very little to assist women and their families.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"If it is not right for our daughters, mothers or our wives, it is not right for any woman.  ","id":"5","topic":"Prostitution","unitType":"premise"},{"content":"I find the continued existence of and the increase in poverty in Canada extremely worrisome.  ","id":"6","topic":"Poverty","unitType":"premise"},{"content":"According to the Hunger Count 2011 Report, released on November 16 by Banques alimentaires Qu?bec, the use of food banks has increased by 22% in Quebec since 2008.  ","id":"6","topic":"Poverty","unitType":"premise"},{"content":"What is more, 15.6% of people used a food bank for the first time.  ","id":"6","topic":"Poverty","unitType":"premise"},{"content":"Nearly three times as many seniors are using food banks and nearly half of the households asking for help are families with children.  ","id":"6","topic":"Poverty","unitType":"premise"},{"content":"This situation is very troubling.  ","id":"6","topic":"Poverty","unitType":"premise"},{"content":"In my riding, unemployment is high and the population is aging.  ","id":"6","topic":"Poverty","unitType":"premise"},{"content":"These factors obviously affect the need for food aid.  ","id":"6","topic":"Poverty","unitType":"premise"},{"content":"The Louiseville organization called Le No?l du pauvre has noticed an increase in requests for help.  ","id":"6","topic":"Poverty","unitType":"premise"},{"content":"I feel it is our duty, as elected members, to work to implement measures that will fight poverty in Canada.  ","id":"6","topic":"Poverty","unitType":"conclusion"},{"content":"I am committed to doing just that, as are my NDP colleagues, and I urge the government to do the same.  ","id":"6","topic":"Poverty","unitType":"conclusion"},{"content":"Canada's economy may be doing well, but across the country there are millions of Canadians who live in poverty.  ","id":"7","topic":"Poverty","unitType":"premise"},{"content":"This is especially true for women and children, as has been reported across the country today.  ","id":"7","topic":"Poverty","unitType":"premise"},{"content":"Single female seniors are particularly challenged.  ","id":"7","topic":"Poverty","unitType":"premise"},{"content":"One report provides the example of a single female senior who, having worked all her life to raise her three children, has had to give up her car, buy second-hand clothes and live on combined benefits of $16,000 per year.  ","id":"7","topic":"Poverty","unitType":"premise"},{"content":"The United Nations agency for children, UNICEF, reports that in Canada ?our children are suffering from unacceptable rates of poverty?.  ","id":"7","topic":"Poverty","unitType":"premise"},{"content":"The levels of poverty in this country, especially for women and children, are totally unacceptable.  ","id":"7","topic":"Poverty","unitType":"premise"},{"content":"The Leader of the Opposition has recently outlined real and meaningful plans to deal with the issue of poverty in Canada, but from the government we hear nothing.  ","id":"7","topic":"Poverty","unitType":"conclusion"},{"content":"That is an absolute shame.  ","id":"7","topic":"Poverty","unitType":"conclusion"},{"content":"Canadians deserve better.  ","id":"7","topic":"Poverty","unitType":"conclusion"},{"content":"the group Canadians Addressing Sexual Exploitation has sponsored white ribbon against pornography week and some of the members of the House are wearing white ribbons in support of this.  ","id":"8","topic":"Pornography","unitType":"premise"},{"content":"People who view pornography are affected in different ways, but they are all affected.  ","id":"8","topic":"Pornography","unitType":"premise"},{"content":"Child molesters have been shaped by the pornography they view.  ","id":"8","topic":"Pornography","unitType":"premise"},{"content":"Individuals who become rapists have by pornography been desensitized to the personhood and dignity of women.  ","id":"8","topic":"Pornography","unitType":"premise"},{"content":"And those seduced by pornography who do not become sexual criminals nevertheless develop a contaminated view of human sexuality.  ","id":"8","topic":"Pornography","unitType":"premise"},{"content":"This breeds unfaithfulness to one's spouse and is therefore destructive to families.  ","id":"8","topic":"Pornography","unitType":"premise"},{"content":"We are reminded of the need to restrain the pornography industry which causes so much personal devastation and societal harm.  ","id":"8","topic":"Pornography","unitType":"conclusion"},{"content":"Those opposing this cancer are to be commended for their courage and endeavours in these days.  ","id":"8","topic":"Pornography","unitType":"premise"},{"content":"how can Canadians trust the Liberals when they say they will protect children and then avoid positive action on the possession of child pornography?  ","id":"9","topic":"Child Pornography","unitType":"conclusion"},{"content":"The recent throne speech said that the government would work with Canadians to ensure that our communities continue to be safe.  ","id":"9","topic":"Child Pornography","unitType":"premise"},{"content":"Its focus will be balanced, combining prevention and a community centred approach with action to deal with serious crime.  ","id":"9","topic":"Child Pornography","unitType":"premise"},{"content":"Child pornography is a serious crime and in response on Friday 300,000 Canadians voiced their community-centred approach through a petition against child pornography insisting the government defend the law.  ","id":"9","topic":"Child Pornography","unitType":"premise"},{"content":"In response, the justice minister accuses Reform members of being scaremongers.  ","id":"9","topic":"Child Pornography","unitType":"premise"},{"content":"Obviously the minister does not feel obligated to the community will, and also has no ability to get cabinet approval for action.  ","id":"9","topic":"Child Pornography","unitType":"premise"},{"content":"Children are the most vulnerable members of society and they deserve the fullest protection of the law.  ","id":"9","topic":"Child Pornography","unitType":"premise"},{"content":"Liberal sentiments delivered in regal fashion do not close legal loopholes or defend families.  ","id":"9","topic":"Child Pornography","unitType":"premise"},{"content":"The poor Liberal justice system will only be improved when the system defenders are replaced by the system changers in the opposition.  ","id":"9","topic":"Child Pornography","unitType":"conclusion"},{"content":"young people who do not want to use drugs have come to me expressing grave concerns about what is happening in their communities, all because the Liberal government is sending the wrong message across Canada about drugs.  ","id":"10","topic":"Marijuana","unitType":"conclusion"},{"content":"By decriminalizing marijuana, our government is forcing our youth to live in a world where drug use is making life more difficult.  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"Psychological pressure to use marijuana is increasing.  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"Drug induced crime creates more tension and problems.  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"A good education is more difficult to obtain because of the negative behaviour and attitudes of their classmates using pot.  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"Drug offences in Saskatchewan have increased by 97% in the last 10 years.   Our youth deserve better.  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"Being free to grow and develop should be their right.  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"Instead, the damaging influence of drug use pollutes their environment.  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"Protecting Canada's youth should be our number one priority.  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"Why does the Liberal government care so little about our young people?  ","id":"10","topic":"Marijuana","unitType":"premise"},{"content":"there may be a, shall we say, pink elephant in the room when it comes to the legalization of marijuana.  ","id":"11","topic":"Marijuana","unitType":"premise"},{"content":"First let us talk about the risks.  ","id":"11","topic":"Marijuana","unitType":"premise"},{"content":"Quebeckers are aware of them.  ","id":"11","topic":"Marijuana","unitType":"premise"},{"content":"Some of those risks include normalization of marijuana use, public health impacts, and increased use by our young people, just to name a few.  ","id":"11","topic":"Marijuana","unitType":"premise"},{"content":"Then there is production.  ","id":"11","topic":"Marijuana","unitType":"premise"},{"content":"The opening of this new market should benefit more than just the Liberals' friends.  ","id":"11","topic":"Marijuana","unitType":"premise"},{"content":"As we have seen, almost every cannabis company has a former minister or well-known Liberal on its board of directors.  ","id":"11","topic":"Marijuana","unitType":"premise"},{"content":"If we vote to legalize marijuana, it must be done right.  ","id":"11","topic":"Marijuana","unitType":"conclusion"},{"content":"It must not have a negative impact on our young people or the general public, and it must certainly not be done just to benefit the Liberals' friends.  ","id":"11","topic":"Marijuana","unitType":"conclusion"},{"content":"The government has not yet done anything to address Quebeckers' concerns or to avoid the appearance of a conflict of interest.  ","id":"11","topic":"Marijuana","unitType":"premise"},{"content":"Things are off to a bad start.  ","id":"11","topic":"Marijuana","unitType":"conclusion"},{"content":"I stand in the House today to once again voice my complete commitment to stricter gun control legislation.  ","id":"12","topic":"Gun Control","unitType":"conclusion"},{"content":"On November 8, Dr. Gary Romalis, my constituent, was shot while eating breakfast in his kitchen.  ","id":"12","topic":"Gun Control","unitType":"premise"},{"content":"For Canadians incidents of this nature are horrifying and incomprehensible.  ","id":"12","topic":"Gun Control","unitType":"premise"},{"content":"They should not have to be endured by any society.  ","id":"12","topic":"Gun Control","unitType":"premise"},{"content":"I implore all my colleagues to work toward more effective gun control and crime prevention measures.  ","id":"12","topic":"Gun Control","unitType":"conclusion"},{"content":"We must make shootings of this nature a thing of the past.  ","id":"12","topic":"Gun Control","unitType":"premise"},{"content":"I feel deeply for Dr. Romalis and his family.  ","id":"12","topic":"Gun Control","unitType":"premise"},{"content":"I know I am joined by all members of this House in wishing him a full and speedy recovery.  ","id":"12","topic":"Gun Control","unitType":"premise"},{"content":"I am very disturbed by the number of shootings on Canadian streets and in our homes.  ","id":"12","topic":"Gun Control","unitType":"premise"},{"content":"As the federal representative for Vancouver South, I will continue to advocate initiatives that will make our streets and homes safer.  ","id":"12","topic":"Gun Control","unitType":"conclusion"}]