[{"content":"the Prime Minister is absurdly wrapping himself and his party in the cloak of human rights on the marriage issue, suggesting that support for traditional marriage reflects hostility to basic rights, but Canadian political history tells a totally different story.","topic":"Human Rights","unitType":"premise"},{"content":"It was the Liberal Party that imposed the infamous head tax on Chinese immigrants; created a racist immigration system with the Exclusion Act; interred all Japanese Canadians; rejected Jewish refugees before and during the war; imposed martial law in 1970; permitted Ernst Zundel to run for its party leadership in 1968; eliminated constitutionally guaranteed rights for confessional education; and preached moral equivalence during the cold war and in China today.","topic":"Human Rights","unitType":"premise"},{"content":"It was Conservative governments that introduced the Bill of Rights; gave aboriginals the right to vote; opposed the War Measures Act; led the fight against apartheid; understood the moral dimension of the cold war; and appointed the first woman and minority cabinet ministers.","topic":"Human Rights","unitType":"premise"},{"content":"Today it is conservatives who believe that the political currency of human rights is devalued when political demands are inflated into fundamental rights claims.","topic":"Human Rights","unitType":"conclusion"},{"content":"Today, as always, Conservatives stand without compromise for the dignity of the human person.","topic":"Human Rights","unitType":"conclusion"},{"content":"January 28 was the 20th anniversary of the Supreme Court of Canada's Morgentaler decision, which decriminalized abortion in Canada.","topic":"Status of Women","unitType":"premise"},{"content":"The legal decision was a victory for Canadian women.","topic":"Status of Women","unitType":"premise"},{"content":"The court fully recognized that the law was unfair and that it presented unreasonable obstacles to women seeking abortions.","topic":"Status of Women","unitType":"premise"},{"content":"While the Morgentaler decision is something to celebrate, women in Canada still face obstacles in accessing abortion services.","topic":"Status of Women","unitType":"premise"},{"content":"The number of hospitals in Canada providing these services is declining and some provincial governments are violating the Canada Health Act by refusing to fund clinics, thus leaving women without the right to choose.","topic":"Status of Women","unitType":"premise"},{"content":"The government is failing ordinary women in Canada by not ensuring equal and accessible abortion services.","topic":"Status of Women","unitType":"conclusion"},{"content":"This is an equality issue and another example of the government's disregard for the welfare and rights of women.","topic":"Status of Women","unitType":"conclusion"},{"content":"this week marks the 20th anniversary of a very important ruling for women.","topic":"Status of Women","unitType":"premise"},{"content":"In the Dr. Morgentaler case, the Supreme Court of Canada decriminalized abortion.","topic":"Status of Women","unitType":"premise"},{"content":"After a tough 20-year battle led by doctors and women's groups, this ruling finally allowed women to take control of their bodies and their pregnancies and to have access to safe abortion.","topic":"Status of Women","unitType":"premise"},{"content":"Since then, they have had the freedom to choose.","topic":"Status of Women","unitType":"premise"},{"content":"That is why any threat by this Conservative government to limit the right to abortion is a direct affront to women's rights.","topic":"Status of Women","unitType":"premise"},{"content":"Bill C-484 by the hon.","topic":"Status of Women","unitType":"premise"},{"content":"Conservative member for EdmontonSherwood Park opens the door to criminalizing abortion.","topic":"Status of Women","unitType":"premise"},{"content":"We are against taking any steps backward.","topic":"Status of Women","unitType":"conclusion"},{"content":"Abortion is a vested right ensuring the well-being and equality of women.","topic":"Status of Women","unitType":"conclusion"},{"content":"the wild rose grows prolifically across my province, its delicate beauty often belying its resiliency to flourish after harsh winters.","topic":"Status of Women","unitType":"premise"},{"content":"The women of Alberta will not be silent.","topic":"Status of Women","unitType":"conclusion"},{"content":"We demand action, and we demand it now.","topic":"Status of Women","unitType":"conclusion"},{"content":"We will ensure a strong Alberta, and in doing so, a strong Canada.","topic":"Status of Women","unitType":"conclusion"},{"content":"I cannot think of a better metaphor for the women of Alberta.","topic":"Status of Women","unitType":"premise"},{"content":"This year, they are being tested, as they and their families are out of work, many for over a year.","topic":"Status of Women","unitType":"premise"},{"content":"They bear the burden of their families' lost incomes and lost pride.","topic":"Status of Women","unitType":"premise"},{"content":"They do this while making the hard choices necessary to keep a roof over their heads.","topic":"Status of Women","unitType":"premise"},{"content":"In the midst of their own struggles, their shoulders are cried on by those who do not want handouts, but just want to work.","topic":"Status of Women","unitType":"premise"},{"content":"I thank them for their strength and their sacrifice.","topic":"Status of Women","unitType":"premise"},{"content":"The women of Alberta watch as the government ignores us, calls the work we do dirty, raises our taxes, and prioritizes everything everywhere else except for us.","topic":"Status of Women","unitType":"premise"},{"content":"If one tries to uproot a wild rose, one ends up with a fist full of thorns.","topic":"Status of Women","unitType":"premise"},{"content":"last week I held a town hall meeting on problems faced by new immigrants to Canada.","topic":"Immigration","unitType":"premise"},{"content":"Representatives from over 30 cultural groups gathered for a discussion of delays in processing, the need for settlement services and difficulties in obtaining accreditation for training received in other countries.","topic":"Immigration","unitType":"premise"},{"content":"One man from South America with Masters degrees in both science and education told of being accepted as an independent class immigrant on the basis of his 15 years' teaching experience.","topic":"Immigration","unitType":"premise"},{"content":"However when he reached Canada he discovered he did not qualify to teach here.","topic":"Immigration","unitType":"premise"},{"content":"His current job is restocking vending machines.","topic":"Immigration","unitType":"premise"},{"content":"A PhD student from China talked about other examples of wasted immigrant talent.","topic":"Immigration","unitType":"premise"},{"content":"He said It's just like pulling out a tree--you transport it to this country but you forget to water it.","topic":"Immigration","unitType":"premise"},{"content":"Immigrants and our wonderful country deserve so much better from this government.","topic":"Immigration","unitType":"conclusion"},{"content":"it has really been quite a week for the Conservatives.","topic":"Status of Women","unitType":"premise"},{"content":"Eighty-six Conservative MPs, including ten cabinet ministers, voted to take away a woman's right to choose.","topic":"Status of Women","unitType":"premise"},{"content":"The Minister for the Status of Women said two years ago that she did not want to reopen the abortion debate, then she voted to do the opposite.","topic":"Status of Women","unitType":"premise"},{"content":"Listen to the comments the member for Fort McMurrayAthabasca made to his local radio show.","topic":"Status of Women","unitType":"premise"},{"content":"They reported that he said the code surrounding abortion in Canada is on par with North Korea human rights abuses.","topic":"Status of Women","unitType":"premise"},{"content":"To quote, We're exactly at the same place as North Korea, China, and Vietnam.","topic":"Status of Women","unitType":"premise"},{"content":"It gets worse.","topic":"Status of Women","unitType":"premise"},{"content":"Yesterday, when I asked a question about the Conservatives inviting white supremacists to committee, the Minister of State for Science and Technology started defending this group, shouting free speech.","topic":"Status of Women","unitType":"premise"},{"content":"Here is what makes the Conservatives uncomfortable: the NDP is in favour of women's right to choose and we do not like white supremacists.","topic":"Status of Women","unitType":"conclusion"},{"content":"I rise today to recognize Frederick Couchie, father of Marianna Couchie, Chief of Nipissing No.","topic":"Human Rights","unitType":"premise"},{"content":"Today I call on all Canadians to study our history, understand the consequences of discrimination and avoid repeating historic blunders so that thousands of people like Fred Couchie did not suffer in vain.","topic":"Human Rights","unitType":"conclusion"},{"content":"Chi-meegwetch.","topic":"Human Rights","unitType":"premise"},{"content":"10 reserve.","topic":"Human Rights","unitType":"premise"},{"content":"Fred Couchie was sent to Garnier Indian residential school at the age of nine.","topic":"Human Rights","unitType":"premise"},{"content":"His name was taken from him and in its place, he was given the number 76.","topic":"Human Rights","unitType":"premise"},{"content":"Away from his family and community he was robbed of his culture, his language and his dignity.","topic":"Human Rights","unitType":"premise"},{"content":"Consequently, throughout his life Fred suffered from both physical and psychological health problems.","topic":"Human Rights","unitType":"premise"},{"content":"The residential school system existed because one group of people thought that they were better than another and believed that they had the right to impose their language, culture and beliefs on the first nations people.","topic":"Human Rights","unitType":"premise"},{"content":"I wish to remind Canadians of the atrocities that are committed when one group thinks itself as superior.","topic":"Human Rights","unitType":"premise"},{"content":"Race, gender, culture, religion, and sexual orientation are but a few of the excuses humans use to subjugate others.","topic":"Human Rights","unitType":"premise"},{"content":"54 years ago today, the United Nations adopted the genocide treaty, sometimes referred to as the never again treaty, to prevent and protect against this most unthinkable and unspeakable of crimes.","topic":"Human Rights","unitType":"premise"},{"content":"Regrettably, and incredibly, genocide became the paradigmatic form of armed conflict in the 1990s, including the advocacy and perpetration of genocide in the Balkans and Rwanda.","topic":"Human Rights","unitType":"premise"},{"content":"The enduring lesson of the Holocaust is that Nazism succeeded not only because of the industry of death but because of the ideology of hate.","topic":"Human Rights","unitType":"premise"},{"content":"It was this teaching of contempt, this demonizing of the other, this is where it all began.","topic":"Human Rights","unitType":"conclusion"},{"content":"Fifty years later we have witnessed an appalling trafficking in state sanctioned hate, which led us down the road to the unthinkable, ethnic cleansing in the Balkans, the unspeakable, the preventable genocide in Rwanda, and the demonizing, once again, of the Jews.","topic":"Human Rights","unitType":"premise"},{"content":"What is needed at this point is a strategy of prevention, a culture of human rights in place of a culture of hate; a culture of respect in place of a culture of contempt, of respect for the inherent dignity of the human person, and the equal dignity of all persons everywhere.","topic":"Human Rights","unitType":"conclusion"},{"content":"under the umbrella of free speech, some groups are using university campuses, like York, to undermine the fabric of civil discourse with events they have entitled Israel Apartheid Week.","topic":"Human Rights","unitType":"premise"},{"content":"Such events will inevitably sow discord, promote negative stereotyping and fuel hatred.","topic":"Human Rights","unitType":"premise"},{"content":"One might well ask what motivates groups like the Canadian Arab Federation, CUPE Ontario and CUPW in their endorsement and organization of Israel Apartheid Week.","topic":"Human Rights","unitType":"premise"},{"content":"The safety and security of Jewish students and their instructors will be unnecessarily placed in danger by these demonstrations.","topic":"Human Rights","unitType":"premise"},{"content":"The cause of peace in the Middle East will not be advanced by eroding the principles of freedom in Canadian universities.","topic":"Human Rights","unitType":"premise"},{"content":"I invite the House to join me in condemning these Israel Apartheid Week activities and in encouraging university administrations to take steps to stop anti-Semitism and the dissemination of hatred.","topic":"Human Rights","unitType":"conclusion"},{"content":"in the Toronto Star of Monday, March 14 I read about a visit by two members of the Reform Party to my riding of Trinity-Spadina.","topic":"Immigration","unitType":"premise"},{"content":"In particular, however, I would like to extend an invitation to more of the members of the Reform Party so that they too may benefit from these lessons.","topic":"Immigration","unitType":"conclusion"},{"content":"In their travels they visited Chinatown and Kensington Market where they felt they would encounter Canadians of origins other than English and French who would share with them their opinions of slashing immigration to Canada.","topic":"Immigration","unitType":"premise"},{"content":"In the process they discovered that the majority of those with whom they spoke looked favourably on the government's immigration policy.","topic":"Immigration","unitType":"premise"},{"content":"One respondent business person, Mr. Danny Tran, a recent immigrant who creates jobs himself, said that more immigrants meant more jobs.","topic":"Immigration","unitType":"premise"},{"content":"Because of these responses the title of the article was \"Reformers Get An Education\".","topic":"Immigration","unitType":"premise"},{"content":"To no one's surprise, least of all my own, they discovered that the multicultural mix of Trinity-Spadina positively contributes to the dynamic nature of Toronto.","topic":"Immigration","unitType":"premise"},{"content":"If the hon.","topic":"Immigration","unitType":"premise"},{"content":"members had ventured around the corner to the Alexander Park Community Housing complex, they would have also learned of how three years ago a determined group of residents, multicultural in character, led by Mr. Sonny Atkinson, banded together and drove out the drug problem.","topic":"Immigration","unitType":"premise"},{"content":"In conclusion, I would like to extend an invitation to all Canadians to visit Trinity-Spadina to discover these well kept secrets of the success of multiculturalism.","topic":"Immigration","unitType":"conclusion"},{"content":"I wish to draw to the attention of the House the plight of a pregnant Nigerian mother of five children, Safiya Husseini, who has been condemned to death by stoning for having committed adultery.","topic":"Human Rights","unitType":"premise"},{"content":"The man responsible for the pregnancy has been released without penalty because under Islamic shariah law practised in parts of Nigeria there must be four eyewitnesses to the act before he can be convicted of either adultery or rape.","topic":"Human Rights","unitType":"premise"},{"content":"Nigeria is a signatory to the UN convention against cruel or inhumane punishment.","topic":"Human Rights","unitType":"premise"},{"content":"Surely being stoned to death for adultery is cruel and inhumane in the extreme.","topic":"Human Rights","unitType":"premise"},{"content":"I call upon the Government of Canada to intervene in the matter and make it clear to the government of Nigeria that such barbarity will not be condoned by the civilized world.","topic":"Human Rights","unitType":"conclusion"},{"content":"for more than two years a herd of 800 Canadian owned alpacas has been held in Australia pending clearance by Agriculture Canada.","topic":"Immigration","unitType":"premise"},{"content":"These animals originated in New Zealand where they may have contacted the neuroparasite E-Cervi from deer.","topic":"Immigration","unitType":"premise"},{"content":"There is no evidence that alpacas can carry and transmit this parasite, but it has not been proved that they cannot.","topic":"Immigration","unitType":"premise"},{"content":"The parasite has a dormancy period of several years and there is no clinical test for it.","topic":"Immigration","unitType":"premise"},{"content":"One must wonder why Agriculture Canada's concern for the health of Canadian animals is greater than the concern of Immigration Canada for the health and welfare of Canadian people.","topic":"Immigration","unitType":"conclusion"},{"content":"Every year thousands of immigrants enter Canada without being screened for HIV.","topic":"Immigration","unitType":"premise"},{"content":"The transmission vectors of this virus are well known.","topic":"Immigration","unitType":"conclusion"},{"content":"25 years ago, in the landmark Morgentaler decision, the Supreme Court recognized a woman's right to choose.","topic":"Abortion","unitType":"premise"},{"content":"Today, New Democrats recognize and thank Dr. Henry Morgentaler for his commitment to protecting a women's right to reproductive choice.","topic":"Abortion","unitType":"premise"},{"content":"Thanks to Dr. Morgentaler's fight, a generation of Canadian women has had access to choice.","topic":"Abortion","unitType":"premise"},{"content":"We acknowledge the health care professionals and service providers who still take risks to perform abortions.","topic":"Abortion","unitType":"premise"},{"content":"We stand in solidarity with advocates and women fighting to support women's reproductive rights.","topic":"Abortion","unitType":"premise"},{"content":"Today, 25 years later, a vast majority of Canadians support a woman's right to choose, and that is why the Conservative government has veiled its attempts to roll back women's reproductive rights.","topic":"Abortion","unitType":"premise"},{"content":"We must remain vigilant: challenges to accessing abortion care in Canada still exist.","topic":"Abortion","unitType":"premise"},{"content":"Women's reproductive rights are fundamental to the struggle for the full equality of women here in Canada and abroad.","topic":"Abortion","unitType":"conclusion"},{"content":"Today, as we celebrate this important anniversary, we must commit ourselves to ensuring that future generations of Canadian women have reproductive choice, for all of us.","topic":"Abortion","unitType":"conclusion"},{"content":"Quebeckers and Canadians were horrified to find out that three Conservative MPs asked the RCMP to launch a criminal investigation into some abortions.","topic":"Abortion","unitType":"premise"},{"content":"They clearly consider women who resort to this medical practice to be murderers.","topic":"Abortion","unitType":"premise"},{"content":"The Prime Minister claims he does not want to reopen the abortion debate, but through his silence he is condoning the guerrilla tactics that a number of Conservative members are using to attack one of women's fundamental rights.","topic":"Abortion","unitType":"premise"},{"content":"The members for Kitchener Centre and Langley have moved two motions in the House to reopen the debate, and now three Conservative members are using the RCMP for partisan and ideological purposes in order to circumvent Parliament and the Supreme Court.","topic":"Abortion","unitType":"premise"},{"content":"The NDP is proud to defend a woman's right to choose.","topic":"Abortion","unitType":"premise"},{"content":"Fundamental rights cannot be called into question, either directly or indirectly.","topic":"Abortion","unitType":"conclusion"},{"content":"The Prime Minister should keep his promises.","topic":"Abortion","unitType":"conclusion"},{"content":"recently the Manitoba Association of School Trustees, the Council of Women of Winnipeg and other community activists have expressed great concern with Canada's age of consent for sexual activity.","topic":"Criminal Code","unitType":"premise"},{"content":"All involved express that which we have known for a long time: The age of consent must be raised from 14 to 16.","topic":"Criminal Code","unitType":"premise"},{"content":"All too often we hear of very young girls and boys falling victim to sexual predators.","topic":"Criminal Code","unitType":"premise"},{"content":"Sadly this fate is most often suffered by young girls who are two or three times more likely to be a victim.","topic":"Criminal Code","unitType":"premise"},{"content":"In fact 54% of girls under 16 have been the targets of unwanted sexual advance.","topic":"Criminal Code","unitType":"premise"},{"content":"It is the responsibility of this government to help the nation's parents protect our children.","topic":"Criminal Code","unitType":"premise"},{"content":"We need to see tough consequences for the people who prey upon the sexual naivety of our young.","topic":"Criminal Code","unitType":"premise"},{"content":"We need laws that reinforce our commitment to stopping these sexual predators before they strike.","topic":"Criminal Code","unitType":"conclusion"},{"content":"This starts with the prohibition of adults engaging in sexual contact with persons under the age of 16.","topic":"Criminal Code","unitType":"conclusion"},{"content":"this Friday, Canada will undergo its third universal periodic review at the United Nations.","topic":"Human Rights","unitType":"premise"},{"content":"This is an important moment when Canada will be held accountable by other UN member states on our domestic human rights track record.","topic":"Human Rights","unitType":"premise"},{"content":"Canada's human rights violations, including discrimination against indigenous peoples, violence against women, systemic racism, and poverty, will be discussed on the world stage.","topic":"Human Rights","unitType":"premise"},{"content":"The federal government is responsible for ensuring compliance with the Canada Health Act.","topic":"Human Rights","unitType":"premise"},{"content":"The act requires universal coverage for all insured persons for all medically-necessary services.","topic":"Human Rights","unitType":"premise"},{"content":"Furthermore, the federal government provides direct health care for first nations, military personnel, and incarcerated individuals.","topic":"Human Rights","unitType":"premise"},{"content":"Canada can and must be willing to use the Canada Health Act to ensure safe and equal abortion access for all people in Canada.","topic":"Human Rights","unitType":"premise"},{"content":"The government must do its duty and embrace a recommendation to use the Canada Health Act as a mechanism to ensure safe and equal access to abortion for all.","topic":"Human Rights","unitType":"conclusion"},{"content":"25 years ago this week, the Supreme Court of Canada ruled that restricting abortion is an unconstitutional attack on women's rights, freedoms and security.","topic":"Abortion","unitType":"premise"},{"content":"Terminating a pregnancy is for the individual woman to decide, period.","topic":"Abortion","unitType":"conclusion"},{"content":"We in the NDP are proud to unequivocally support women's right to choose freely.","topic":"Abortion","unitType":"premise"},{"content":"The same cannot be said of the members across the floor.","topic":"Abortion","unitType":"premise"},{"content":"Since they came to power in 2006, the Conservatives have attempted on six separate occasions to reverse that Supreme Court decision.","topic":"Abortion","unitType":"premise"},{"content":"Why so many underhanded attacks?","topic":"Abortion","unitType":"premise"},{"content":"Why do the Conservatives want to prevent women from having control over their own bodies?","topic":"Abortion","unitType":"premise"},{"content":"The Prime Minister promised not to reopen the abortion debate, but clearly, once again, it is up to the NDP to stand up for women's right to choose.","topic":"Abortion","unitType":"premise"},{"content":"The Conservatives continue to stubbornly defend regressive ideas that have been rejected by Canadians.","topic":"Abortion","unitType":"premise"},{"content":"It is not up to the church or the state to decide, and it is certainly not up to the Conservatives.","topic":"Abortion","unitType":"conclusion"},{"content":"this week I have my hair in braids, much like I have had for most of my childhood.","topic":"Body Shaming","unitType":"premise"},{"content":"However, it has come to my attention that there are young girls here in Canada and other parts of the world who are removed from school, or shamed because of their hairstyle.","topic":"Body Shaming","unitType":"premise"},{"content":"Body shaming of any woman in any form from the top of her head to the soles of her feet is wrong, irrespective of her hairstyle, the size of her thighs, the size of her hips, the size of her baby bump, the size of her breasts, or the size of her lips.","topic":"Body Shaming","unitType":"premise"},{"content":"What makes is different makes us unique and beautiful.","topic":"Body Shaming","unitType":"premise"},{"content":"I will continue to rock these braids for three reasons.","topic":"Body Shaming","unitType":"premise"},{"content":"Number one, because I am sure everyone will agree, they look pretty dope; number two, in solidarity with women who have been shamed based on their appearance; and number three, and most importantly, in solidarity with young girls and women who look like me and those who do not.","topic":"Body Shaming","unitType":"premise"},{"content":"I want them to know that their braids, their dreads, their super curly Afro puffs, their weaves, their hijabs, and their head scarves, and all other variety of hairstyles, belong in schools, in the workplace, in the boardroom, and yes, even here on Parliament Hill.","topic":"Body Shaming","unitType":"conclusion"},{"content":"when I spoke yesterday in the House of the danger of anti-Jewish terror, the targeting of Jews because they are Jews, we in the House did not know that at that moment, in a tragic irony, a murderous terrorist assault on a Jewish school in Jerusalem was taking place.","topic":"Human Rights","unitType":"premise"},{"content":"","topic":"Human Rights","unitType":"conclusion"},{"content":"Nor could we even fathom that, in an obscene declaration, Hamas would actually bless the terrorist attack and call for more, while thousands celebrated the killings in the streets.","topic":"Human Rights","unitType":"premise"},{"content":"It reminded me of the words of Mideast scholar Fouad Ajami.","topic":"Human Rights","unitType":"premise"},{"content":"At the time of the Passover massacre, yet another anti-Jewish terrorist attack, he wrote: \r  [The suicide bomber] did not descend from the sky: He walked straight out of the culture of incitement....","topic":"Human Rights","unitType":"premise"},{"content":"He partook of the culture all around him--the glee that greets those brutal deeds of terror, the cult that rises around the martyrs and their families.","topic":"Human Rights","unitType":"premise"},{"content":"This culture of hate must end.","topic":"Human Rights","unitType":"premise"},{"content":"This incitement must stop.","topic":"Human Rights","unitType":"conclusion"},{"content":"For it is this Hamas sanctioned hate and incitement that leads to Hamas rockets targeting Jews in Sderot and Ashqelon and terrorist attacks in Jerusalem.","topic":"Human Rights","unitType":"conclusion"},{"content":"We need a culture of peace, not a culture of hate.","topic":"Human Rights","unitType":"premise"},{"content":"we have been witness for some time to a revolution in human rights, where human rights has emerged as the new secular religion of our time.","topic":"Human Rights","unitType":"premise"},{"content":"The whole inspired by a revolution in international human rights law where, in particular, more has happened in the last five years in international humanitarian law than in the previous 50, and where the United Nations, whose founding we commemorate, has been the linchpin of that revolution.","topic":"Human Rights","unitType":"premise"},{"content":"Regrettably, however, the refugees of humanity, the agony of Africa, the brutalized child, the preventable genocide in Rwanda, each can be forgiven if they think that this human rights revolution has passed them by.","topic":"Human Rights","unitType":"premise"},{"content":"It is important now that we reaffirm the founding principles of the UN, of the equality of all states, large and small, so that no states are singled out for discriminatory treatment while major human rights violators enjoy exculpatory immunity; of the universality of human rights so that economic, social and cultural rights, the rights of the disadvantaged are seen as authoritative norms; of the guarding against undue politicization of the UN wherein the UN becomes an arena for the waging of conflict rather than for conflict resolution; of gender mainstreaming within the decision making of the UN; and of the protection against mass atrocity organized around a culture of prevention rather than belated intervention.","topic":"Human Rights","unitType":"conclusion"},{"content":"I rise here today to denounce certain government MPs' attempts to criminalize abortion.","topic":"Status of Women","unitType":"premise"},{"content":"Of course, they know that their approach is extremely unpopular with women, who hate it when men try to tell them what to do with their bodies.","topic":"Status of Women","unitType":"premise"},{"content":"That is why these members are drawing inspiration from the Republican Party and using roundabout ways and bogus motions that are based on pseudo-science.","topic":"Status of Women","unitType":"premise"},{"content":"Let us be clear: this will not work.","topic":"Status of Women","unitType":"premise"},{"content":"Canadian women have a right to access abortion and this backwards-thinking government cannot take that away from them.","topic":"Status of Women","unitType":"premise"},{"content":"Our party has always defended women's rights and we will continue to do so.","topic":"Status of Women","unitType":"premise"},{"content":"It is unfortunate that we cannot say the same for this government, which has let Motion M-312, moved by the member for Kitchener Centre, in by the back door in order to attack women directly.","topic":"Status of Women","unitType":"premise"},{"content":"It is not enough to answer on behalf of the government that it has no intention of reopening the abortion debate becausehere is a reality checkMotion M-312 has already opened it.","topic":"Status of Women","unitType":"premise"},{"content":"We must close it immediately.","topic":"Status of Women","unitType":"conclusion"},{"content":"a survey released yesterday by the Quebec minister responsible for relations with the public shows that Quebecers are increasingly tolerant and open to ethnic and cultural diversity.","topic":"Immigration","unitType":"conclusion"},{"content":"A majority of people believe that immigration promotes economic development, with 72 per cent regarding it as contributing to the province's cultural richness.","topic":"Immigration","unitType":"conclusion"},{"content":"Young Quebecers are the ones who have the most positive and dynamic attitude in this respect.","topic":"Immigration","unitType":"premise"},{"content":"This bodes well for the future of Quebec.","topic":"Immigration","unitType":"premise"},{"content":"Comparisons with the rest of Canada are striking.","topic":"Immigration","unitType":"premise"},{"content":"While only 29 per cent of respondents in Montreal consider that there are too many immigrants in their city, in Toronto and Vancouver, that percentage rises to 46 per cent and 49 per cent respectively.","topic":"Immigration","unitType":"premise"},{"content":"This goes to show that the people of Quebec have the most positive attitude toward immigration in Canada.","topic":"Immigration","unitType":"premise"},{"content":"I can personally attest to that.","topic":"Immigration","unitType":"premise"},{"content":"Newcomers who choose Quebec as their new home can expect a warm welcome.","topic":"Immigration","unitType":"conclusion"},{"content":"I rise today to bring attention to the outrageous sentence delivered to Meriam Yehya Ibrahim Ishag by a Sudanese court recently.","topic":"Human Rights in Sudan","unitType":"premise"},{"content":"This young Sudanese Christian mother was sentenced to death for apostasy, in other words the renouncing of Islam, as she is a practising Christian.","topic":"Human Rights in Sudan","unitType":"premise"},{"content":"What is more, she was also sentenced to 100 lashes for adultery, which is particularly outrageous because she is in the late stages of pregnancy with her second child.","topic":"Human Rights in Sudan","unitType":"premise"},{"content":"While her husband is of South Sudanese origin, he is non-Muslim and therefore the court does not recognize the marriage.","topic":"Human Rights in Sudan","unitType":"premise"},{"content":"That is how the trumped-up charges regarding adultery were brought forth.","topic":"Human Rights in Sudan","unitType":"premise"},{"content":"I am appalled, the Government of Canada is appalled, and the people of Canada are appalled by this flagrant abuse of human rights.","topic":"Human Rights in Sudan","unitType":"premise"},{"content":"This clearly infringes on the right of freedom of religion that is enshrined in Sudan's own 2005 interim constitution.","topic":"Human Rights in Sudan","unitType":"premise"},{"content":"Furthermore, it contravenes African and international treaties ratified by Sudan that prohibit this sort of shocking punishment.","topic":"Human Rights in Sudan","unitType":"premise"},{"content":"I call on the government of Sudan to intervene in this case and abide by its human rights obligations to its own people and to the international community.","topic":"Human Rights in Sudan","unitType":"conclusion"},{"content":"in 1948 the World Medical Association adopted a Hippocratic oath to guide the ethical practice of medical doctors.","topic":"Abortions","unitType":"premise"},{"content":"","topic":"Abortions","unitType":"conclusion"},{"content":"It reads in part:\r I will maintain the utmost respect for human life from the time of conception.","topic":"Abortions","unitType":"premise"},{"content":"In the early 1970s medical schools stopped requiring new doctors to take the oath and the Canadian Medical Association code of ethics no longer requires any reference to abortion.","topic":"Abortions","unitType":"premise"},{"content":"The medical profession has abandoned its responsibility for the unborn child and now it is up to Canadians to assume that responsibility.","topic":"Abortions","unitType":"premise"},{"content":"Last year there were over 110,000 abortions in Canada with a cost to our health care system of over $10 million.","topic":"Abortions","unitType":"conclusion"},{"content":"That is over 300 abortions each and every day.","topic":"Abortions","unitType":"premise"},{"content":"It says that each year 110,000 mistakes are made at the expense of all Canadians by those who fail to act responsibly.","topic":"Abortions","unitType":"premise"},{"content":"Is it too much to ask Canadians just to be responsible for their actions?","topic":"Abortions","unitType":"premise"},{"content":"We do have a choice and that choice should be made before we act, not after we have failed to act responsibly.","topic":"Abortions","unitType":"premise"},{"content":"on October 1, we will celebrate the 10th anniversary of UN Security Council Resolution 1325 on women, peace and security, with particular attention to situations of conflict.","topic":"Status of Women","unitType":"premise"},{"content":"On behalf of all women, I am calling on the Prime Minister to take into account the status of women in cases of violence and in Canada's peace operations.","topic":"Status of Women","unitType":"premise"},{"content":"I am asking that all Canadian Forces training guidelines include the protection of women's rights and needs.","topic":"Status of Women","unitType":"premise"},{"content":"Canada reaffirmed its position in the final declaration of the Global Parliamentarians Summit on population and development held in Ottawa in 2010, and in the recommendations by the G8 leaders.","topic":"Status of Women","unitType":"premise"},{"content":"These declarations include universal access to HIV\/AIDS prevention and treatment, and care and support for women with HIV or AIDS, a condition that must also be part of every new peace accord.","topic":"Status of Women","unitType":"conclusion"},{"content":"I rise today on this World Refugee Day to outline the Conservatives' contempt for women.","topic":"Status of Women","unitType":"premise"},{"content":"Looking back over the past year, there is not much here for the fairer sex.","topic":"Status of Women","unitType":"premise"},{"content":"What is more, our Prime Minister does not even trust the women in his caucus to speak on his behalf during question period.","topic":"Status of Women","unitType":"premise"},{"content":"Indeed, only 22 questions out of 349 were answered by women.","topic":"Status of Women","unitType":"premise"},{"content":"That is a measly 6%.","topic":"Status of Women","unitType":"premise"},{"content":"That is sad, but the NDP will always be proud to stand up for women.","topic":"Status of Women","unitType":"conclusion"},{"content":"In Bill C-31, a bill against refugees, the Conservatives are targeting the most vulnerable women by directly attacking sexual abuse survivors who are seeking asylum.","topic":"Status of Women","unitType":"premise"},{"content":"The Conservatives do not care.","topic":"Status of Women","unitType":"premise"},{"content":"The Conservatives also attacked women in Bill C-10, by putting more and more women in prison for minor crimes, when statistics show that the majority of women in prison are also mothers.","topic":"Status of Women","unitType":"premise"},{"content":"This legislation is breaking up families.","topic":"Status of Women","unitType":"premise"},{"content":"The omnibus budget bill, which was passed on Monday, amends the Employment Equity Act.","topic":"Status of Women","unitType":"premise"},{"content":"Again, women are being targeted.","topic":"Status of Women","unitType":"premise"},{"content":"The height of contempt is Motion M-312, a motion that, in 2012, opens the abortion debate.","topic":"Status of Women","unitType":"premise"},{"content":"Women have fought for their rights, and the Conservatives are allowing a man to interfere and send women back to the days of knitting-needle abortions.","topic":"Status of Women","unitType":"premise"},{"content":"yesterday, a Conservative member again announced his intention to reopen the abortion debate.","topic":"Abortion","unitType":"premise"},{"content":"Every once in a while, the Conservatives attack women's rights and we in the NDP must stand together to fend off those attacks.","topic":"Abortion","unitType":"premise"},{"content":"If this Prime Minister is sincere when he says that the right to abortion is not threatened in Canada, then why do his members keep attacking that right?","topic":"Abortion","unitType":"premise"},{"content":"The NDP knows that the vast majority of Canadians believe that women have the right to choose.","topic":"Abortion","unitType":"premise"},{"content":"We are the only party in the House that voted unanimously to uphold that right.","topic":"Abortion","unitType":"premise"},{"content":"We are calling on the Conservative government to move on and do something tangible to ensure women's equality.","topic":"Abortion","unitType":"conclusion"},{"content":"The hon.","topic":"Abortion","unitType":"premise"},{"content":"member for Kitchener Centre may want to live in the past, but we know that today, every woman decides for herself what to do with her body.","topic":"Abortion","unitType":"conclusion"},{"content":"the Conservative government is once again trying to impose its ideological agenda on Quebec women by reopening the abortion debate.","topic":"Status of Women","unitType":"premise"},{"content":"The chair of the anti-abortion caucus introduced a bill meant to isolate women who are considering the procedure.","topic":"Status of Women","unitType":"premise"},{"content":"It is not just domestically that this government is calling into question a woman's right to choose.","topic":"Status of Women","unitType":"premise"},{"content":"While the minister responsible for CIDA is announcing her child and maternal health plan for the 10 poorest countries, we still do not know whether the organizations that offer abortion-related services will continue to be funded.","topic":"Status of Women","unitType":"premise"},{"content":"All forms of birth control, including abortion, should be funded by this plan.","topic":"Status of Women","unitType":"premise"},{"content":"The Fdration du Qubec pour le planning des naissances, the Fdration des femmes du Qubec and Action Canada for Population and Development are just some of the organizations that oppose these backward and ideological decisions.","topic":"Status of Women","unitType":"premise"},{"content":"The Conservative government must stop tampering with the hard-won rights of women once and for all.","topic":"Status of Women","unitType":"conclusion"},{"content":"this year marks the 50th anniversary of the signing of the labour market agreement between the governments of Canada and Jamaica.","topic":"Immigration","unitType":"premise"},{"content":"During the period of 1955, our immigration policies prevented non-white immigration.","topic":"Immigration","unitType":"premise"},{"content":"One hundred women entered Canada as domestics, even though many were nurses and teachers in their own country: 75 came from Jamaica and 25 from Barbados.","topic":"Immigration","unitType":"premise"},{"content":"I salute two of these pioneers, Thelma Johnson, a nurse and businesswoman, founder of the Caribbean Pioneer Women of Canada, and Sealen Chang, a former member of the Royal Canadian Air Force and retired teacher.","topic":"Immigration","unitType":"premise"},{"content":"It is these women and many others who, despite the hardships of those early years, have contributed to making Canada a more welcoming and inclusive place to live.","topic":"Immigration","unitType":"conclusion"},{"content":"On behalf of all the children they nurtured and shared their values and beliefs with, I wish them and all the residents of LavalLes les well.","topic":"Immigration","unitType":"premise"},{"content":"it has been 29 years since abortion was legalized in this country.","topic":"Abortion","unitType":"premise"},{"content":"In those days abortion was used only where a mother's life or health was endangered.","topic":"Abortion","unitType":"premise"},{"content":"But today I think it has gone too far, especially when we see taxpayer funded abortions on demand, increased diagnoses of post-abortion trauma, indication of medical linkages to breast cancer, minors given abortion without parental consent and approximately $50 million spent annually on abortion.","topic":"Abortion","unitType":"conclusion"},{"content":"Not everybody in the Reform caucus or across the country agrees with me.","topic":"Abortion","unitType":"premise"},{"content":"That is why the Reform Party's responsible position is to identify abortion as an issue of personal conscience and supports informed debate and giving people a voice through a national referendum.","topic":"Abortion","unitType":"premise"},{"content":"Canadians should be allowed to examine the facts on all sides of the issue.","topic":"Abortion","unitType":"premise"},{"content":"In my opinion, women have a right to know about the risks of abortion and taxpayers should know the cost.","topic":"Abortion","unitType":"conclusion"},{"content":"For me, if it is about choice, let us give women better choices.","topic":"Abortion","unitType":"conclusion"},{"content":"a million babies, give or take a few, have lost their lives in the last 10 years.","topic":"Abortion","unitType":"premise"},{"content":"268 calls for a binding national referendum at the time of the next election to ask whether or not voters are in favour of government funding for medically unnecessary abortions.","topic":"Abortion","unitType":"premise"},{"content":"I urge every member who feels strongly about saving the lives of tens of thousands of helpless infants to support this motion and to help me convince the House to make it votable.","topic":"Abortion","unitType":"conclusion"},{"content":"Is parliament horrified?","topic":"Abortion","unitType":"premise"},{"content":"No.","topic":"Abortion","unitType":"premise"},{"content":"Is the media in an uproar for the government to do something?","topic":"Abortion","unitType":"premise"},{"content":"No.","topic":"Abortion","unitType":"premise"},{"content":"Thanks to the Supreme Court of Canada and weak-kneed politicians, Canada has been without any restrictions on abortion for 10 years.","topic":"Abortion","unitType":"premise"},{"content":"Not only are there no restrictions when a woman can get an abortion between the time of conception and until the baby emerges alive from the birth canal, but the government has forced taxpayers to pay for the killing of these one million babies.","topic":"Abortion","unitType":"premise"},{"content":"I have introduced a motion that would at least put a stop to government funding for abortions, a measure which two-thirds of Canadians support.","topic":"Abortion","unitType":"premise"},{"content":"My private members' Motion No.","topic":"Abortion","unitType":"premise"},{"content":"as a member of Parliament I often hear the concerns of Canadians for their loved ones overseas who are subject to difficulty.","topic":"Human Rights","unitType":"premise"},{"content":"Canada promotes human rights around the world.","topic":"Human Rights","unitType":"conclusion"},{"content":"Parliamentarians have a responsibility to make it our first priority to raise our voice in support of every person's fundamental human rights.","topic":"Human Rights","unitType":"conclusion"},{"content":"A good MP cannot help but extend heartfelt compassion and ensure that these concerns are heard by government and Parliament.","topic":"Human Rights","unitType":"premise"},{"content":"Tamils, for example, have experienced great difficulty in Sri Lanka.","topic":"Human Rights","unitType":"premise"},{"content":"Accountability and real reconciliation need to occur there.","topic":"Human Rights","unitType":"premise"},{"content":"Iran continues to violate the rights of individuals, including academics, journalists and Baha'is.","topic":"Human Rights","unitType":"premise"},{"content":"Reports that Falun Gong practitioners are arbitrarily detained in China are disconcerting.","topic":"Human Rights","unitType":"premise"},{"content":"People in Sudan and the Ogaden region, among others, still face violence.","topic":"Human Rights","unitType":"premise"},{"content":"There are many, many examples.","topic":"Human Rights","unitType":"premise"},{"content":"My constituents told me of these situations and I have relayed them to our government.","topic":"Human Rights","unitType":"premise"},{"content":"madam, October is Women's History Month and also Breast Cancer Awareness Month.","topic":"Status of Women","unitType":"premise"},{"content":"There have been some hard-fought battles by many women in both of these areas.","topic":"Status of Women","unitType":"premise"},{"content":"There are a number of important events in women's history, including the creation of the Fdration nationale Saint-Jean-Baptiste in 1907, which was created out of the desire of francophone women to separate themselves from the existing anglophone feminist movement.","topic":"Status of Women","unitType":"premise"},{"content":"This allowed feminist Quebeckers to speak for themselves, since they belonged to their own nation.","topic":"Status of Women","unitType":"premise"},{"content":"Women must fight against a number of issues together, but they must also fight as individuals, as is the case with breast cancer.","topic":"Status of Women","unitType":"conclusion"},{"content":"Research is essential if we want this disease to be history eventually.","topic":"Status of Women","unitType":"conclusion"},{"content":"Today, too many workers, refugees and aboriginal women still struggle with problems of discrimination and violence.","topic":"Status of Women","unitType":"premise"},{"content":"We hope that one day, these devastating scourges, like breast cancer will be things of the past.","topic":"Status of Women","unitType":"conclusion"},{"content":"to date 81 of 87 members of a Chinese investment delegation who came to Canada on visitors visas have disappeared and gone underground.","topic":"Immigration","unitType":"premise"},{"content":"Do not give visitors visas when Canadian safety is at stake.","topic":"Immigration","unitType":"conclusion"},{"content":"It seems they were well aware of the government's let them all in immigration policy and the minister's generosity.","topic":"Immigration","unitType":"conclusion"},{"content":"Now some of the delegates have turned up to make refugee claims.","topic":"Immigration","unitType":"premise"},{"content":"Now they are entitled to free health care, welfare and lawyers at taxpayers' expense.","topic":"Immigration","unitType":"premise"},{"content":"This episode should serve as a warning.","topic":"Immigration","unitType":"premise"},{"content":"Next year the immigration minister in his infinite wisdom will be issuing visas and the health minister will be handing out $1 million to bring to Canada 500 AIDS sufferers from the third world to attend a conference in Vancouver.","topic":"Immigration","unitType":"premise"},{"content":"Since AIDS sufferers have been granted refugee status already in Canada, the question is not if some of the 500 AIDS sufferers will jump ship and make a refugee claim, but how many.","topic":"Immigration","unitType":"premise"},{"content":"I call on the government to use a little common sense.","topic":"Immigration","unitType":"premise"},{"content":"Enforce the law.","topic":"Immigration","unitType":"premise"},{"content":"since I came to the House, I have seen and heard plenty of Conservative rubbish about abortion.","topic":"Abortion","unitType":"premise"},{"content":"However, nothing prepared me for the appalling letters that were sent this week.","topic":"Abortion","unitType":"premise"},{"content":"Three Conservative members, male of course, wrote to the RCMP asking them investigate certain instances of abortion that they feel constitute murder.","topic":"Abortion","unitType":"premise"},{"content":"These three pathetic musketeers are out to dismantle women's rights and obviously have not understood that this issue was settled a long time ago.","topic":"Abortion","unitType":"premise"},{"content":"Threatening women who have opted for this procedure with imprisonment because they can do as they choose with their bodies and labelling them as murderers when they are already in emotional turmoil is irresponsible, dangerous, unworthy of a member of Parliament and downright disgusting.","topic":"Abortion","unitType":"conclusion"},{"content":"If the Prime Minister is telling the truth and does not want to reopen this debate, he needs to break his complicit silence and clearly tell these backward-thinking members that this type of action is unacceptable.","topic":"Abortion","unitType":"conclusion"},{"content":"Otherwise, the weight of their offensive actions will also rest on his shoulders.","topic":"Abortion","unitType":"conclusion"},{"content":"yesterday the Supreme Court of Canada launched an unprecedented attack on democracy and on our constitutional order in what can only be described as an exercise of raw judicial power.","topic":"Human Rights","unitType":"premise"},{"content":"In the name of the charter of rights and freedoms the court ruled that Albertans do not have the right or freedom to govern themselves.","topic":"Human Rights","unitType":"premise"},{"content":"In the name of the Constitution the unaccountable justices created a law that had been explicitly rejected by Alberta's elected officials and they did so basing this judgment on a right that cannot be found in the Constitution and one which was explicitly rejected by this parliament and the legislatures when the charter of rights was ratified.","topic":"Human Rights","unitType":"premise"},{"content":"In the name of protecting basic rights, the court has violated the rights of people to freely associate around common values in a private religious institution.","topic":"Human Rights","unitType":"premise"},{"content":"The Vriend decision was not about interpreting the Constitution.","topic":"Human Rights","unitType":"conclusion"},{"content":"It was not about protecting rights.","topic":"Human Rights","unitType":"conclusion"},{"content":"It was about unelected and unaccountable justices taking upon themselves the position of elected legislators and legislating from the bench.","topic":"Human Rights","unitType":"conclusion"},{"content":"February 5 was the 30th anniversary of police raids on four Toronto bathhouses, all of them important gay community institutions.","topic":"Human Rights","unitType":"premise"},{"content":"Bath raids did not end in 1981, but the Toronto raids changed the politics of gay liberation and pushed many to come out politically.","topic":"Human Rights","unitType":"premise"},{"content":"We remember those arrested and outed, sometimes with tragic consequences, and those inspired to work for full human rights.","topic":"Human Rights","unitType":"conclusion"},{"content":"","topic":"Human Rights","unitType":"conclusion"},{"content":"Almost 300 men were arrested, one of the largest mass arrests in Canadian history.","topic":"Human Rights","unitType":"premise"},{"content":"The response to these raids was immediate and angry, with thousands taking to the streets.","topic":"Human Rights","unitType":"premise"},{"content":"This marked a turning point for the queer community and for Canada's human rights history.","topic":"Human Rights","unitType":"premise"},{"content":"Not only did our community organize, but strong allies also emerged, including the member for TorontoDanforth.","topic":"Human Rights","unitType":"premise"},{"content":"Margaret Atwood famously remarked at one rally, What do the police have against cleanliness?","topic":"Human Rights","unitType":"premise"},{"content":"\r The raids were a low point in the history of relations between the gay community and the police and the state, but change resulted.","topic":"Human Rights","unitType":"premise"},{"content":"The Right to Privacy Committee began many years of defending those arrested and raising civil liberties and privacy issues.","topic":"Human Rights","unitType":"premise"},{"content":"Toronto's first pride parade was held later that year.","topic":"Human Rights","unitType":"premise"}]